MicrochipTech/dspic33a-high-speed-adc-example/cli.c
void console_sweep(uint32_t halves, bool choose)
{
    uint32_t count = 0;
    const struct pll_step *steps = capture_sweep_steps(&count);  /* slowest rate first */
    const bool was_running = capture_running();

    console_kv("[sweep] halves per point", halves);
    console_puts("[sweep] back-to-back conversions; the rate is the ADC clock, PLL1 output dividers\r\n"
                 "[sweep] slowest rate first: the first row is the one the DMA should manage,\r\n"
                 "[sweep] so a failure there is the chain, not the rate\r\n"
                 "[sweep] idle = CPU polls RAM only, process = main-loop processing, sfr = CPU polls an SFR\r\n"
                 "[sweep] overrun must be 0 for a usable rate; late/missed are from the process run\r\n"
                 "[sweep] postdiv = PLL1 POSTDIV1/POSTDIV2; the adc clock is read back from the registers\r\n"
                 "[sweep] clean = rate of one burst with nothing else running; loaded = rate while\r\n"
                 "[sweep] the three runs below are going. Trust clean: the loaded figure is\r\n"
                 "[sweep] measured by a CPU drowning in overrun interrupts\r\n");

    /* Time base check: 100 ms of CPU time (200 MHz) must be 1 250 000
     * ticks. Anything else and the measured rates are off by the same
     * factor - and the assumption about the timer's clock is wrong. */
    console_kv("[sweep] timer check, ticks per 100 ms (expect 1250000)", timebase_check());

    struct pll_step best = { 0u, 0u };
    uint32_t best_ksps = 0u;              /* fastest clean row           */
    uint32_t clean = 0u, rows = 0u;
    for (uint32_t i = 0; i < count; i++) {
        console_puts("[sweep] ");
        rows++;
        if (sweep_row(steps[i], halves)) {
            clean++;
            const uint32_t k = capture_nominal_ksps(0u);
            if (k > best_ksps) { best = steps[i]; best_ksps = k; }
        }
    }
    console_kv("[sweep] rows", rows);
    console_kv("[sweep] rows with overrun 0, late 0 and missed 0", clean);

    /* The question the sweep answers: the highest rate at which the CPU
     * gets every half (missed 0) and the DMA every sample (overrun 0),
     * with the main-loop processing running. A rate with overruns also
     * raises the DMA interrupt for every lost sample (1.6 million per
     * second at 40 MSPS on the board) and starves the console. */
    if (best_ksps != 0u) {
        console_kv("[sweep] highest clean rate, ksps", best_ksps);
        console_kv("[sweep]   at POSTDIV1", best.p1);
        console_kv("[sweep]   at POSTDIV2", best.p2);
        if (choose) { (void)capture_set_pll(best.p1, best.p2); }
    } else {
        console_puts("[sweep] NO CLEAN RATE - every row lost samples or halves\r\n");
    }
    if (!choose) { (void)capture_set_pll(ADC_PLL_POSTDIV1, ADC_PLL_POSTDIV2); }
    counters_clear();
    if (was_running) { capture_start(); }
    console_puts("[sweep] done: counters cleared\r\n");
}

static void cmd_sweep_fn(int argc, char **argv)
{
    uint32_t halves = SWEEP_HALVES_DEFAULT;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 10u, 100000u, &halves))) {
        usage("sweep [halves per point 10..100000, default 2000]");
        return;
    }
    console_sweep(halves, false);
}
CMD_DEFINE(sweep, "sweep", cmd_sweep_fn, "sweep [halves] - overrun vs sample rate over the clock ladder");

static void cmd_clk_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 100u, 1000u, &v)) {
        usage("clk <100..1000>  (ADC clock divide ratio x 100: 100 = 320 MHz = 40 MSPS, 500 = 64 MHz = 8 MSPS, 1000 = 32 MHz = 4 MSPS, the slowest the ADC may run)");
        return;
    }
    const uint32_t rc = capture_set_clkdiv(v);
    put_kv("ratio asked for", v);
    put_kv("ratio read back", capture_clkdiv());
    put_kv("adc clock Hz", clock_adc_hz());
    put_kv("ksps nominal", capture_nominal_ksps(v));
    put_line(clock_adc_div_error(rc));
    if (rc != CLKDIV_OK) { cmd_parser_fail(); }
}
CMD_DEFINE(clk, "clk", cmd_clk_fn, "clk <100..1000> - CLKGEN6 divide ratio x 100 (does NOT change the rate)");

static void cmd_pll_fn(int argc, char **argv)
{
    uint32_t p1, p2;
    if ((argc != 3) || !arg_u32(argv[1], 1u, 7u, &p1) || !arg_u32(argv[2], 1u, 7u, &p2)) {
        usage("pll <postdiv1 1..7> <postdiv2 1..7>  (ADC clock = 1600 MHz / (p1*p2), p1 >= p2; 5 1 = 320 MHz = 40 MSPS, 5 5 = 64 MHz = 8 MSPS, 7 7 = 32.65 MHz = 4.08 MSPS)");
        return;
    }
    const uint32_t rc = capture_set_pll(p1, p2);
    put_kv("postdiv1", clock_adc_pll_postdiv1());
    put_kv("postdiv2", clock_adc_pll_postdiv2());
    put_kv("adc clock Hz", clock_adc_hz());
    put_kv("ksps nominal", capture_nominal_ksps(0u));
    put_line(clock_adc_div_error(rc));
    if (rc != CLKDIV_OK) { cmd_parser_fail(); }
}
CMD_DEFINE(pll, "pll", cmd_pll_fn, "pll <p1> <p2> - PLL1 output dividers = the sample rate");

/* ------------------------------------------------------------------ *
 * "test" - the parts of a run, one command
 *
 * The firmware does nothing on its own any more: it boots, brings the
 * console up and waits. The colleague at the board first proves that the
 * console works at all (anything typed echoes, "help" answers), then
 * runs the parts of the test from here. Every part ends in exactly one
 * PASS or FAIL line so that the log stays readable.
 *
 * Order in "test all", and the reason for it:
 *   self   is the chain intact?  ADC -> DMA -> RAM on the internal
 *          reference, at the slowest clock. If this fails nothing after
 *          it means anything, so "all" stops here and only here.
 *   clock  does a divider change arrive in the hardware? Every ratio is
 *          switched and read back, nothing is measured. This separates
 *          "the switch does not happen" from "the switch happens and the
 *          rate does not follow" - the question run 7 left open.
 *   sweep  where is the limit? The ladder from the slowest rate up, with
 *          overrun, late and missed per point. This is the table the
 *          customer gets.
 *   dac    does everything arrive, in order? The DAC2 triangle through
 *          the same chain. Counters cannot show a swapped or skipped
 *          half; a known signal can.
 * ------------------------------------------------------------------ */
#define TEST_SWEEP_HALVES   2000u
#define TEST_RATE_HALVES    200u
#define TEST_DAC_HALVES     64u

static bool test_self(void)
{
    uint32_t mean = 0;
    console_puts("[test] self: ADC -> DMA -> RAM on the internal 15/16 VDD reference\r\n");
    const uint32_t rc = capture_selftest(&mean);
    console_kv("[test]   mean (expect 3648..4032)", mean);
    console_puts((rc == 0u) ? "[test] self: PASS\r\n" : "[test] self: FAIL\r\n");
    if (rc == 6u)      { console_puts("[test]   no data - nothing converted\r\n"); }
    else if (rc == 7u) { console_puts("[test]   mean outside the window\r\n"); }
    else if (rc == 8u) { console_puts("[test]   the DMA channel switched itself off\r\n"); }
    return rc == 0u;
}

